---
kind: other
id: Properties.T:Autodesk.Revit.DB.ModelCurveNode
source: html/2084315c-9496-75e1-8792-adb438c471ec.htm
---
# ModelCurveNode Properties

Specifies whether the .NET object represents a valid Revit entity.